import React from 'react'
import {Container,Header,Icon,Segment} from 'semantic-ui-react'
const {tableau} = window;

export default class Viz extends React.Component
{
    constructor() {
        super();
        this.inputRefs = [];
        this.state = {
            urls: ["https://public.tableau.com/views/Project_15935511520180/Dashboard1",
            "https://public.tableau.com/shared/JFNNJZFXM",
            "https://public.tableau.com/views/youngpeopleexcludedfromworkandeducation_15945764966010/Dashboard2",
            "https://public.tableau.com/views/Employmentratesbysex_educationalattainmentlevel/Dashboard1"]
        };
        this.initViz = () => {
            for (let i = 0; i < this.state.urls.length; i++) {
                const url = this.state.urls[i];
                const ref = this.inputRefs[i];
                new tableau.Viz(ref, url);
            }
          };
    }
    
    componentDidMount() {
        
        this.props.onMount(this);
        this.initViz();
    }

    render(){
        return(
            <Container id={this.props.sectionId}>
                <Header as='h1'>
                  <Icon name='area graph' color='blue'/>
                  <Header.Content className='colorlib-heading'>
                    Οπτικοποιησεις
                  </Header.Content>
                </Header>
                <br/><br/>
                <h1 className='colorlib-heading'>κινδυνος φτωχειας εναντια στην ανεργια στις χωρες της Ευρωπης</h1>
                <div style={ setVizStyle } ref={inputRef => { this.inputRefs.push(inputRef) }} ></div>
                <br/><br/><br/><br/><br/><br/>
                <Segment>
                    <p>Παραπάνω βλέπουμε την οπτικοποίηση για <b>τον κίνδυνο φτώχειας ενάντια στην ανεργία στις χώρες της Ευρώπης</b>. Ο χρήστης μπορεί να χρησιμοποιήσει τα φίλτρα για να προσαρμόσει τα δεδομένα, ανά <i>χρονιά</i>, 
                    καθώς και ανά την <i>ευρήτερη περιοχή της Ευρώπης</i> - "Βαλκάνια", "Άλπικές χώρες" κλπ. -  για την οποία επιθυμεί να οπτικοποιήσει. Ακόμα δίνεται η δυνατότητα προβολής της μεταβολής του ΑΕΠ ανα χρονολογία με την επιλογή
                    Play/Stop. Οι <u>κουκίδες παριστάνουν τις χώρες</u> της Ευρώπης και το <u>μέγεθος τους το μέγιστο ακαθάριστο εγχώριο προϊόν(ΑΕΠ/GDP)</u>. 
                    Με την επιλογή ευρήτερης περιοχής χρωματίζονται και αποχρωματίζονται οι χώρες που περιέχονται σε αυτή την περιοχή. Όσο πιο δεξιά βρίσκεται μία χώρα τόσο μεγαλύτερο ποσοστό ανεργίας έχει και όσο πιο ψηλά τόσο μεγαλύτερο κίνδυνο φτώχειας.</p>
                    <p><i><u>Επισημαίνεται ότι για τη χρονιά 2019, το dataset δε διέθεται ολοκληρωμένα δεδομένα και για αυτό το λόγο στην οπτικοποίηση δε φαίνεται το σύνολο των χωρών. </u></i></p>
                </Segment>
                <br/><br/>
                <h1 className='colorlib-heading'>ποσοστο του πληθυσμου που εχει αποφοιτησει μονο απο τη βασικη εκπαιδευση και δε συμμετεχει σε περαιτερω εκπαιδευση και καταρτιση</h1>
                <div style={ setVizStyle } ref={inputRef => { this.inputRefs.push(inputRef) }} ></div>
                <br/><br/><br/><br/><br/><br/>
                <Segment>
                    <p>
                        Παραπάνω βλέπουμε την οπτικοποίηση για <b>το ποσοστό του πληθυσμού που έχει αποφοιτήσει μόνο από τη βασική εκπαίδευση και δε συμμετέχει σε περαιτέρω εκπαίδευση και κατάρτιση</b>, στις χώρες της Ευρώπης. Κοιτάζοντας το χάρτη, από τα χρώματα
                        μπορεί κανείς να διακρίνει το ποσοστό της κάθε χώρας και επίσης μπορεί να επιλέξει περιφέρειες της κάθε χώρας και να δει αναλυτικά τα ποσοστά ανά φύλο, τα οποία φαίνονται στην οπτικοποίηση με τις μπάρες ακριβώς κάτω από το χάρτη.
                        Τέλος μπορεί κανείς να προσαρμόσει τα δεδομένα ανά χρονιά.
                    </p>
                </Segment>
                <br/><br/>
                <h1 className='colorlib-heading'>νεοι που δεν εργαζονται και δεν σπουδαζουν</h1>
                <div style={ setVizStyle } ref={inputRef => { this.inputRefs.push(inputRef) }} ></div>
                <br/><br/><br/><br/><br/><br/>
                <Segment>
                    <p>Παραπάνω βλέπουμε την οπτικοποίηση για τους <b>νέους που δεν εργάζονται και δεν σπουδάζουν</b> στις χώρες της Ευρωπης. Κοιτάζοντας το χάρτη, από τα χρώματα μπορεί κανείς να διακρίνει το μέσο όρο των νέων για κάθε χώρα. Μπορεί κανείς να 
                    επιλέξει χώρες ή και περιφέρειες αυτών, προκειμένου να εμφανιστούν στο κάτω πίνακα με το διάγραμμα γραμμών η χρονική μεταβολή του μέσου αυτού όρου. Ο χρήστης μπορεί ακόμα να διαχωρίσει τα δεδομένα ανά φύλο.
                    </p>
                </Segment>

                <br/><br/>
                <h1 className='colorlib-heading'>ποσοστο ατομων που απασχολουνται ανα φυλο και εκπαιδευτικη βαθμιδα</h1>
                <div style={ setVizStyle } ref={inputRef => { this.inputRefs.push(inputRef) }} ></div>
                <br/><br/><br/><br/><br/><br/>
                <Segment>
                    <p>
                        Παραπάνω βλέπουμε την οπτικοποίηση για το <b>ποσοστό ατόμων που απασχολούνται ανα φύλο και εκπαιδευτική βαθμίδα</b> στις χώρες της Ευρωπης. Χρησιμοποιήσαμε μία οπτικοοποίηση με κουκίδες για να δείξουμε με κόκκινο χρώμα το θυλκηκό φύλο, με
                        μπλε το αρσενικό και με κίτρινο το σύνολο αυτών των δύο. Κάθε χώρα έχει μια γραμμή στον άξωνα των Y στην οποία φαίνονται με κουκίδες τα ποσοστά απασχολησιμότητας του πληθυσμού. Ο χρήστης μπορεί να επιλέξει τη βαθμίδα εκπαίδευσης για την οποία 
                        ενδιαφέρεται να αλλάξει τα δεδομένα, αλλά και να τα προβάλει αθροιστικά (επιλέγοντας περισσότερες από μία βαθμίδες). Ακόμα δίνεται η δυνατότητα προβολής της μεταβολής τους ανα χρονολογία με την επιλογή Play/Stop.  
                    </p>
                </Segment>
            </Container>
        )
    }
}

const setVizStyle = {
  width: "1000px",
  height: "700px",
};